kingofoertang-glitch/base_operation_RTOS/02_GD32F407_FreeRTOS_Timer/User/systick.c
/*!
    \file    systick.c
    \brief   the systick configuration file

    \version 2025-07-31, V3.3.2, firmware for GD32F4xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f4xx.h"
#include "systick.h"

#ifndef SYS_SUPPORT_OS

// 不使用操作系统
volatile static uint32_t delay;
volatile static uint64_t tick;

/*!
    \brief    configure systick
    \param[in]  none
    \param[out] none
    \retval     none    
    初始化滴答定时器 168M
    
    1000Hz -> 1ms
    1 000 000Hz -> 1us
*/
void systick_config(void)
{
    /* setup systick timer for 1000000Hz interrupts */
    if(SysTick_Config(SystemCoreClock / 1000000U)) {
        /* capture error */
        while(1) {
        }
    }
    /* configure the systick handler priority */
    NVIC_SetPriority(SysTick_IRQn, 0x00U);
}

/*!
    \brief    delay a time in milliseconds
    \param[in]  count: count in milliseconds
    \param[out] none
    \retval     none
*/
void delay_1ms(uint32_t count)
{
    delay = count * 1000; // 500 * 1000us 

    while(0U != delay) {
    }
}

void delay_1us(uint32_t count)
{
    delay = count;

    while(0U != delay) {
    }
}

uint64_t get_sys_tick(){
    return tick;
}

/*!
    \brief    delay decrement
    \param[in]  none
    \param[out] none
    \retval     none
*/
void delay_decrement(void)
{
    tick++;
    
    if(0U != delay) {
        delay--;
    }
}

#else

// 使用操作系统
void delay_1us(uint32_t count) {
  uint32_t ticks;
  uint32_t told, tnow, reload, tcnt = 0;
  reload = SysTick->LOAD;
  ticks = count * (SystemCoreClock / 1000000);
  told = SysTick->VAL;

  while(1) {
    tnow=SysTick->VAL;
    if(tnow != told) {
      if(tnow<told) tcnt+=told-tnow;
      else tcnt+=reload-tnow+told;
      told=tnow;

      if(tcnt>=ticks)break;
    }
  }
}

void delay_1ms(uint32_t count)
{
  uint32_t i;
  for (i=0; i<count; i++)
  {
    delay_1us(1000);
  }
}

#endif
